---
kind: method
id: M:Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceForegroundPatternVisible(System.Boolean)
source: html/da46f789-13b9-9d24-f99d-1dd2ddb367ab.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceForegroundPatternVisible Method

Sets the visibility of the surface foreground fill pattern.

## Syntax (C#)
```csharp
public OverrideGraphicSettings SetSurfaceForegroundPatternVisible(
	bool fillPatternVisible
)
```

## Parameters
- **fillPatternVisible** (`System.Boolean`) - Value of the visibility of the surface foreground fill pattern.

## Returns
Reference to the changed object.